ДопРеквизиты = Новый СписокЗначений ;
ЗначенияСвойств = Новый Массив;
ЗначенияСвойств.Добавить("ЭКВАЙРИНГ");
ЗначенияСвойств.Добавить("РКО");
ЗначенияСвойств.Добавить("ИНКАССАЦИЯ");
ЗначенияСвойств.Добавить("ВЕТСПРАВКИ");
ЗначенияСвойств.Добавить("ГОР.ВЕТ.СТАНЦИЯ ЛАБОРАТОРИЯ");
ЗначенияСвойств.Добавить("ГОР.ВЕТ.СТАНЦИЯ");
	
Реквизит = Новый Структура ;
// Обязательные свойства реквизита
Реквизит.Вставить("Наименование", 			"Статья_Затрат_Контрагента") ;
Реквизит.Вставить("ТипЗначения", 			Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов"));
Реквизит.Вставить("СправочникНаборДопРек", 	Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Контрагенты) ;
// НЕ обязательные свойства реквизита
Реквизит.Вставить("ЭтоДополнительноеСведение", 	Истина) ;        
Реквизит.Вставить("Заголовок", 					"Статья затрат контрагента") ;        
Реквизит.Вставить("Доступен", 					Истина) ;        
Реквизит.Вставить("ЗаполнятьОбязательно", 		Ложь) ;        
Реквизит.Вставить("МногострочноеПолеВвода",		0) ;  
Реквизит.Вставить("ЗначенияСвойств", ЗначенияСвойств);
ДопРеквизиты.Добавить(Реквизит) ;
	
//
ТаблицаРеквизитов = Новый ТаблицаЗначений ;
ТаблицаРеквизитов.Колонки.Добавить("Реквизит", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(150))) ;
СоответствиеРеквизитов = Новый Соответствие ;
Для Каждого Стр Из ДопРеквизиты Цикл 
	НС = ТаблицаРеквизитов.Добавить() ;
	НС.Реквизит = Стр.Значение.Наименование ;
	СоответствиеРеквизитов.Вставить(НС.Реквизит, Стр.Значение) ;
КонецЦикла;

Запрос = Новый Запрос;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Реквизит
	|ПОМЕСТИТЬ ТМП
	|ИЗ
	|	&Реквизиты КАК Реквизиты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка,
	|	ТМП.Реквизит
	|ИЗ
	|	ТМП КАК ТМП
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|		ПО ТМП.Реквизит = ДополнительныеРеквизитыИСведения.Наименование";
	
Запрос.Параметры.Вставить("Реквизиты", ТаблицаРеквизитов) ;	
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Если ВыборкаДетальныеЗаписи.Ссылка = NULL Тогда 
	
		СтруктураДляНовогоРеквизита = СоответствиеРеквизитов.Получить(ВыборкаДетальныеЗаписи.Реквизит) ;
		
		//	
			Наименование = ВыборкаДетальныеЗаписи.Реквизит;
			ТипЗначения = СтруктураДляНовогоРеквизита.ТипЗначения;
			СправочникНаборДопРек = СтруктураДляНовогоРеквизита.СправочникНаборДопРек;
			ЭтоДополнительноеСведение = СтруктураДляНовогоРеквизита.ЭтоДополнительноеСведение;
			Заголовок = СтруктураДляНовогоРеквизита.Заголовок;
			Доступен = СтруктураДляНовогоРеквизита.Доступен;
			ЗаполнятьОбязательно = СтруктураДляНовогоРеквизита.ЗаполнятьОбязательно;
			МногострочноеПолеВвода = СтруктураДляНовогоРеквизита.МногострочноеПолеВвода;
			ЗначенияСвойств = СтруктураДляНовогоРеквизита.ЗначенияСвойств;

			Если Заголовок = "" Тогда 
				Заголовок = Наименование ;
			КонецЕсли;
			
			Если ТипЗначения = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") 
				ИЛИ ТипЗначения = Тип("СправочникСсылка.ЗначенияСвойствОбъектовИерархия") Тогда 
				ДополнительныеЗначенияИспользуются = Истина ;
			Иначе 
				ДополнительныеЗначенияИспользуются = Ложь ;
			КонецЕсли;
				
			НР = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент() ;
			НР.Виден 								= Истина ;
			НР.Наименование 						= Наименование ;
			НР.ДополнительныеЗначенияИспользуются 	= ДополнительныеЗначенияИспользуются ;
			НР.ДополнительныеЗначенияСВесом 		= Ложь ;
			НР.Доступен 							= Истина ;
			НР.Заголовок 							= Заголовок ;
			НР.ЗаголовокФормыВыбораЗначения 		= Заголовок ;
			НР.ЗаголовокФормыЗначения 				= Заголовок ;
			НР.ЗаполнятьОбязательно		 			= ЗаполнятьОбязательно ;
			НР.МногострочноеПолеВвода 				= МногострочноеПолеВвода ;
			НР.ЭтоДополнительноеСведение 			= ЭтоДополнительноеСведение ;
			НР.НаборСвойств 						= СправочникНаборДопРек ;
			НР.ТипЗначения 							= ТипЗначения ;
			
			НР.Записать();
			
			ЗаписьНабора = СправочникНаборДопРек.ПолучитьОбъект();
			Если ЭтоДополнительноеСведение Тогда
				НовСвойство = ЗаписьНабора.ДополнительныеСведения.Добавить();
			Иначе 
				НовСвойство = ЗаписьНабора.ДополнительныеРеквизиты.Добавить();
			КонецЕсли;
			НовСвойство.Свойство = НР.Ссылка;
			ЗаписьНабора.Записать();
			
			Если ЗначенияСвойств.Количество() > 0 Тогда
				Запрос = Новый Запрос;	
				Запрос.Текст = "ВЫБРАТЬ * 
				|ИЗ Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
				|ГДЕ ЗначенияСвойствОбъектов.Владелец = &Владелец";
				Запрос.УстановитьПараметр("Владелец", НР.Ссылка);
				РезультатЗапроса = Запрос.Выполнить();
				Если РезультатЗапроса.Пустой() Тогда
					Для Каждого Эл Из ЗначенияСвойств Цикл
						спрОб = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
						спрОб.Владелец = НР.Ссылка;
						спрОб.Наименование = Эл;
						спрОб.ПолноеНаименование = Эл;
						спрОб.Записать();
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;	
			
			спр = Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоНаименованию("Платежные поручения");
			спрОб = спр.ПолучитьОбъект();
			спрОб.КоличествоСведений = спрОб.КоличествоСведений + 1;
			НоваяСтрока = спрОб.ДополнительныеСведения.Добавить();
			НоваяСтрока.Свойство = НР.Ссылка;
			спрОб.Записать();

			Сообщить("Создан доп. реквизит: " + НР.Заголовок) ;

	КонецЕсли;
КонецЦикла;

